Repository: mozilla-l10n/mt-training-data
Catalog: pa-PK/pa-PK_pontoon.tmx
Source language: en_us
Languages: pa_pk

source: 1 add-on
pa_pk: ۱ وادھے والا

source: %1$d new permissions are required
pa_pk: %1$d نویں اجازتاں دی لوڑ اے

source: %1$d out of %2$d
pa_pk: %2$d چوں %1$d

source: %1$d selected
pa_pk: %1$d چݨیاں

source: 1 extension
pa_pk: 1 پھیلاؤ

source: 1 open tab. Tap to switch tabs.
pa_pk: اک ٹیب کھُلھی اے۔ ہورناں ٹیب جاوݨ لئی اِتھے چھوہو۔

source: %1$s, %2$d of %3$d
pa_pk: %1$s، %3$d وچوں %2$d

source: %1$s add-ons
pa_pk: %1$s وادھے والے

source: %1$s can close tabs you haven’t viewed over the past month.
pa_pk: جو تسیں پچھلے مہینے توں ودھ دوران ٹیباں نہیں ویکھیاں تاں %1$s اوہناں نوں بند کر سکدا اے۔

source: %1$s can’t automatically reject cookie requests on this site. You can send a request to support this site in the future.
pa_pk: %1$s ایس سائیٹ لئی آپݨے آپ کوکی بینتیاں نوں بند نہیں کر سکدا اے۔ تسیں مستقبل وچ ایس سائیٹ واسطے سہایتا لئی بینتی کر سکدے او۔

source: %1$s can’t download this file type
pa_pk: ایہہ فائل دی قسم %1$s ڈاؤں‌لوڈ کر نہیں سکدی

source: %1$s clears your search and browsing history from private tabs when you close them or quit the app. While this doesn’t make you anonymous to websites or your internet service provider, it makes it easier to keep what you do online private from anyone else who uses this device.
pa_pk: جدوں تسیں ساریاں نجی ٹیباں نوں بند کردے او یا ایپ توں باہر جاندے او تاں %1$s تہاڈی کھوج تے ورتوں دی تاریخ نوں ساف کردا اے۔ حالاں‌کہ ایہہ تہانوں سائٹاں یا تہاڈے اینٹرنیٹ دیݨ والے لئی اݨپچھاتا نہیں بݨاوندا، پر ایس نال ایس فون نوں ورتے والے کسے توں وی تہاڈے ولوں آن‌لائین کیتے نوں نجی رکھݨا ہور سوکھا ہو جاندا اے۔

source: %1$s could not be installed because it can only be installed by an organization using enterprise policies, which isn‘t supported on this platform.
pa_pk: %1$s نوں صرف انٹرپرائیز پالسیاں ورت کے ای سنگٹھن ولوں انسٹال کیتا جا سکدا اے، جو کہ ایس پلیٹفارم تے سہائک نہیں اے، ایس کرکے ایس نوں انسٹال نہیں کیتا جا سکیا۔

source: %1$s could not be installed because it has a high risk of causing stability or security problems.
pa_pk: ستھرتا جاں سرکھیا سمسیاواں کھڑھیاں کرن دے خطرے کرکے %1$s نوں انسٹال نہیں کیتا جا سکیا۔

source: %1$s could not be installed because it is not compatible with %2$s %3$s.
pa_pk: %2$s %3$s نال معافق نہ ہوݨ کرکے %1$s نوں انسٹال نہیں کیتا جا سکیا۔

source: %1$s could not be verified as secure and has been disabled.
pa_pk: %1$s دے سرکھیت ہوݨ نوں تصدیق نہیں کیتا جا سکیا تے اسمرتھ کیتا گیا اے۔

source: %1$s could not verify the authenticity of the application. Do you want to proceed with autofilling the selected credentials?
pa_pk: %1$s ایپ دی تصدیق نہیں کر سکدا۔ کیہ تسیں چݨیاں سنداں نوں آپے بھرن نال جاری رکھݨا چہندے او؟

source: %1$s deletes your cookies, history, and site data when you close all your private tabs. %2$s
pa_pk: جدوں وی آپݨیاں نجی ٹیباں نوں بند کردے او تاں %1$s تہاڈے کوکیاں، تاریخ تے سائیٹ ڈیٹے نوں ہٹا دندا اے۔ %2$s

source: %1$s extensions
pa_pk: %1$s پھیلاؤ

source: %1$s has a new update
pa_pk: %1$s سند توں نویں رچنا چڑھی گئی اے

source: %1$s has been added to %2$s
pa_pk: %2$s نوں %1$s پا لایا

source: %1$s has been disabled due to security or stability issues.
pa_pk: %1$s نوں سرکھیا جاں ستھرتا مسئلیاں کرکے اسمرتھ کیتا گیا اے۔

source: %1$s is not compatible with your version of %2$s (version %3$s).
pa_pk: %1$s %2$s دے تہاڈے ورژن (ورژن %3$s) دے معافق نہیں اے۔

source: %1$s is produced by Mozilla.
pa_pk: %1$s ایپ موزلے ولوں تیار کیتی اے۔

source: %1$s is requesting your username and password.
pa_pk: %1$s تہاڈے ورتنوالے دا ناں تے پاس‌ورڈ دی منگ کر رہی اے۔

source: %1$s just refused cookies for you
pa_pk: %1$s نے ہݨے تہاڈے لئی کوکیاں توں انکار کیتا اے

source: %1$s may install and run studies from time to time.
pa_pk: %1$s وقتاً فوقتاً مطالعہ انسٹال کر تے چلا سکدا اے۔

source: %1$s on %2$s %3$s
pa_pk: %2$s %3$s تے %1$s

source: %1$s open tabs. Tap to switch tabs.
pa_pk: %1$s ٹیباں کھُلھیاں ہن۔ ہورناں ٹیب جاوݨ لئی اِتھے چھوہو۔

source: %1$s (Private Mode)
pa_pk: %1$s (نجی موڈ)

source: %1$s requests additional permissions.
pa_pk: %1$s نوں ودھیک اجازتاں دی لوڑ اے۔

source: %1$s tabs closed: %2$d
pa_pk: %1$s ٹیباں بند کیتیاں: %2$d

source: %2$s is requesting your username and password. The site says: “%1$s”
pa_pk: %2$s تہاڈے ورتنوالے دا ناں تے پاس‌ورڈ دی منگ کر رہی اے۔ ایتھوں سنیہا اے – ”%1$s“

source: About
pa_pk: بارے

source: About %1$s
pa_pk: %1$s بارے

source: Accept and edit suggestion
pa_pk: تجویز منو تے سودھو

source: Accept the Risk and Continue
pa_pk: خطرہ منو تے جاری رکھو

source: Access %1$s from the %2$s menu.
pa_pk: %2$s مینو چوں %1$s پہنچیو۔

source: Access browser activity during navigation
pa_pk: ورتدے دوران ایپ دی سرگرمی نوں پہنچݨا

source: Access browser tabs
pa_pk: ایپ دیاں ٹیباں لئی پہنچݨا

source: Access browsing history
pa_pk: ورتوں دی تاریخ نوں پہنچ جاݨا

source: Accessibility
pa_pk: رسائیت

source: Access recently closed tabs
pa_pk: حالیہ بند کیتیاں ٹیباں نوں پہنچ جاݨا

source: Access to the file was denied
pa_pk: فائل لئی پہنچ توں نانہہ کیتی

source: Access your data for %1$s
pa_pk: %1$s سائٹ لئی تہاڈے ڈیٹے لئی پہنچ

source: Access your data for all websites
pa_pk: سریاں سائٹاں لئی تہاڈے ڈیٹے واسطے پہنچ

source: Access your data for sites in the %1$s domain
pa_pk: %1$s دے وچ ڈیٹے نوں پہنچ جاؤ

source: Access your data on %1$d other domains
pa_pk: %1$d ہورناں ڈومیناں دے وچ ڈیٹے نوں پہنچ جاݨا

source: Access your data on %1$d other sites
pa_pk: %1$d ہورناں سائٹاں دے وچ ڈیٹے نوں پہنچ جاؤ

source: Access your data on 1 other domain
pa_pk: 1 ہورناں ڈومین دے وچ ڈیٹے نوں پہنچ جاؤ

source: Access your data on 1 other site
pa_pk: 1 ہورناں سائٹ دے وچ ڈیٹے نوں پہنچ جاؤ

source: Access your location
pa_pk: تہاڈی ستھتی نوں پہنچ جاݨا

source: Account
pa_pk: کھاتہ

source: Account info
pa_pk: کھاتے دی جاݨکاری

source: Account picture
pa_pk: کھاتے دی تصویر

source: Account settings
pa_pk: کھاتے دیاں سیٹنگاں

source: Active
pa_pk: فعال

source: Add
pa_pk: پتہ پایو

source: Add %1$s?
pa_pk: %1$s رکھ لیو؟

source: Add %1$s and %2$s to %3$s
pa_pk: %3$s نوں %1$s تے %2$s پا لاؤ

source: Add %1$s to %2$s
pa_pk: %2$s نوں %1$s پا لاؤ

source: Add a new folder
pa_pk: نواں فولڈر جوڑو

source: Add a shortcut to open private tabs from your Home screen.
pa_pk: تہاڈی مکھ سکرین توں نجی ٹیباں کھولھݨ لئی شارٹ کٹ جوڑو۔

source: Add bookmark, Shortcut, Home, Collection, PDF
pa_pk: بک‌مارک، شارٹ‌کٹ، مکھ صفحہ، بھنڈار، PDF جوڑو

source: Add Firefox widget
pa_pk: فائرفاکس وجیٹ جوڑو

source: Add folder
pa_pk: فولڈر پایو

source: Add new collection
pa_pk: نواں مجموعہ شامل کرو

source: Add-ons
pa_pk: وادھے والے

source: Add-ons are temporarily disabled
pa_pk: وادھے والے عارضی طور تے چالو نہیں ہن

source: Add-ons Manager
pa_pk: وادھیاں والیاں دیاں سیٹنگاں

source: Add-on updates
pa_pk: وادھے والیاں توں نویاں رچناواں

source: Add private browsing shortcut
pa_pk: نجی براؤز کرن شارٹ‌کٹ جوڑو

source: Add private tab
pa_pk: نجی ٹیب کھولھو

source: Address bar
pa_pk: پتے دی پٹی

source: Address bar - Firefox Suggest
pa_pk: سرناواں پٹی – فائرفاکس سجھاؤ

source: Address bar location
pa_pk: سرناواں پٹی دا ٹکاݨا

source: Address bar preferences
pa_pk: سرناواں پٹی لئی ترجیحاں

source: Addresses
pa_pk: پتے

source: Address Not Found
pa_pk: پتہ نہیں لبھیاں

source: Add shortcut
pa_pk: شارٹ کٹ جوڑو

source: Add tab
pa_pk: نویں ٹیب کھولھو

source: Add them to %1$s
pa_pk: %1$s نوں اوہ پا لاؤ

source: Add to contact
pa_pk: رابطے وچ شامل کرو

source: Add to Home screen
pa_pk: مکھ سکرین تے جوڑو

source: Add to Home screen…
pa_pk: ہوم سکرین تے جوڑو

source: Add username to saved password?
pa_pk: پاس‌ورڈ نال ورتنوالے دا ناں وی رکھیو؟

source: Advanced
pa_pk: اضافی

source: Advanced…
pa_pk: اضافی…

source: After one day
pa_pk: اک دن بعد

source: After one month
pa_pk: اک مہینے بعد

source: After one week
pa_pk: اک ہفتے بعد

source: All actions
pa_pk: ساریاں کاروائیاں

source: All cookies (will cause websites to break)
pa_pk: سارے کوکیاں (ویب‌سائیٹاں دے کم نہ کرن دا کارن ہووےگا)

source: Allow
pa_pk: اجازت دیو

source: ALLOW
pa_pk: اجازت دیو

source: Allow %1$s to play DRM-controlled content?
pa_pk: %1$s نوں کاپی منع دیاں فائلاں ورتݨ دی اجازت دیو؟

source: Allow %1$s to send notifications?
pa_pk: %1$s نوں نوٹ دیوݨ دی اجازت دیو؟

source: Allow %1$s to store data in persistent storage?
pa_pk: %1$s نوں فون وچ ڈیٹے رکھݨ دی اجازت دیو؟

source: Allow %1$s to use its cookies on %2$s?
pa_pk: %1$s نوں %2$s تے کوکی ورتݨ دی اجازت دیو؟

source: Allow %1$s to use your camera?
pa_pk: %1$s نوں کیمرے ورتݨ دی اجازت دیو؟

source: Allow %1$s to use your camera and microphone?
pa_pk: %1$s نوں کیمرے تے مائیکروفون ورتݨ دی اجازت دیو؟

source: Allow %1$s to use your location?
pa_pk: %1$s نوں مقام ورتݨ دی اجازت دیو؟

source: Allow %1$s to use your microphone?
pa_pk: %1$s نوں مائیکروفون ورتݨ دی اجازت دیو؟

source: Allow audio and video
pa_pk: آڈیو تے ویڈیو دی اجازت دیو

source: Allowed
pa_pk: اجازت دتے

source: Allow for all sites
pa_pk: سبھ سائیٹاں لئی منظوری

source: Allow in private browsing
pa_pk: نجی ڈھنگ چ اجازتب دیو

source: Allow screenshots in private browsing
pa_pk: نجی براؤز وچ سکرین‌شاٹ منظور کرو

source: Allow search suggestions in private sessions?
pa_pk: نجی سشناں وچ کھوجݨ والی تجویز دیو؟

source: Allows Mozilla to install and run studies
pa_pk: موزیلے نوں مطالعے انسٹال کرن تے چلاوݨ دے اجازت دیو

source: All third-party cookies (may cause websites to break)
pa_pk: سارے تیجی دھر کوکیاں (ویب‌سائیٹ دے کم نہ کرن دا کارن ہو سکدا)

source: Always
pa_pk: ہمیشہ

source: A new permission is required
pa_pk: نویں اجازت دی لوڑ اے

source: Apr
pa_pk: اپریل

source: Are you sure?
pa_pk: تسیں پکے او؟

source: Are you sure you want to delete this folder?
pa_pk: کیہہ تسیں ایہہ فولڈر نوں ہٹاؤݨا چاہندے او؟

source: Articles powered by %s
pa_pk: %s ولوں تیار کیتے لیکھ

source: Artist series
pa_pk: کلا کار لڑی

source: A site is playing media
pa_pk: اک سائٹ میڈیا چلا رہی اے

source: Ask before opening
pa_pk: کھولھݨ توں پہلا پچھو

source: Ask to allow
pa_pk: اجازت لئی پچھو

source: Audio and video will play on Wi-Fi
pa_pk: وائی‌فائی تے آڈیو تے ویڈیو چلائے جاݨ‌گے

source: Aug
pa_pk: اگست

source: Author
pa_pk: لکھاری

source: Authors
pa_pk: لکھاریاں

source: Auto-close after one month?
pa_pk: اک مہینے بعد آپے بند کرنا اے؟

source: Auto-close open tabs
pa_pk: کھلھیاں ٹیباں لئی آپے بند کرو

source: Autocomplete URLs
pa_pk: آپے پورن URL

source: Automatic
pa_pk: خود بخود

source: Automatically attempts to connect to sites using HTTPS encryption protocol for increased security.
pa_pk: وادھا کیتی سرکھیا لئی HTTPS انکرپشن پروٹوکال ورت کے سائیٹاں نال کنیکٹ کرن دی آپݨے آپ کوشش کرو۔

source: Automatic font sizing
pa_pk: آپݨے آپ فونٹ دے آکار بدلݨے

source: Autoplay
pa_pk: آپے چلاؤ

source: Back
pa_pk: پچھے

source: Block
pa_pk: اجازت نہ دیو

source: Block audio and video
pa_pk: آڈیو تے ویڈیو تے پابندی لاؤ

source: Block audio and video on cellular data only
pa_pk: صرف موبائیل ڈیٹے توں آڈیو تے ویڈیو تے روک لاؤ

source: Block audio only
pa_pk: صرف آڈیو تے پابندی لاؤ

source: Block content on any page
pa_pk: کسے وی صفحے توں سمگری تے روک لاوݨا

source: Blocked
pa_pk: پابندی لگائے

source: Blocked by Android
pa_pk: اینڈرائیڈ ولوں پابندی لگائی

source: Blocks cookies that ad networks and analytics companies use to compile your browsing data across many sites.
pa_pk: کوکیاں تے پابندی لگاوندس اے، جو کہ اشتہار نیٹ‌ورک تے وشلیشݨ کرن والیاں کمپنیاں کئی سائیٹاں تے تہاڈے براؤز کرن دے ڈیٹے نوں اکتر کرن لئی ورتدیاں ہن۔

source: Bookmark
pa_pk: اتا پتہ

source: Bookmarks
pa_pk: اتے پتے

source: Bookmark saved!
pa_pk: بک‌مارک سنبھالیا!

source: Bookmarks deleted
pa_pk: بک‌مارک ہٹایا

source: Bookmarks Menu
pa_pk: بک‌مارک مینو

source: Bookmarks Toolbar
pa_pk: بک‌مارک ٹول‌بار

source: Bookmark this page
pa_pk: ایس صفحے نوں بک‌مارک کرو

source: Bottom
pa_pk: ہیٹھاں

source: Browse faster with new navigation
pa_pk: نویں نیویگیشن نال ودھ تیزی نال براؤز کرو

source: Browse with no saved cookies or history in %1$s
pa_pk: %1$s وچ بناں کسے سنبھالے کوکی جاں تاریخ دے براؤز کرو

source: Browse without a trace
pa_pk: بناں پیڑاں چھڈے براؤز کرو

source: Call
pa_pk: فون کرو

source: Call with…
pa_pk: کیہتھوں کال کرو…

source: Camera
pa_pk: کیمرہ

source: Camera access needed. Go to Android settings, tap permissions, and tap allow.
pa_pk: کیمرے لئی پہنچ چاہیدی اے۔ فون دیاں سیٹنگاں تے جاؤ، اجازتاں نوں چھوہو تے اجازت دیݨ دی چوݨ نوں چھوہو۔

source: Camera and microphone are on
pa_pk: کیمرہ تے مائیکروفون چالو ہن

source: Camera is on
pa_pk: کیمرہ چالو اے

source: Cancel
pa_pk: رد کرو

source: Cancel downloads
pa_pk: رد کرو

source: Cancel private downloads?
pa_pk: نجی ڈاؤں‌لوڈاں نوں رد کرو؟

source: Cannot Complete Request
pa_pk: بنیتی پوری نہیں کیتی جا سکدی

source: Cannot share to this app
pa_pk: ایس ایپ نال سانجھا نہیں کیتا جا سکدا

source: Can’t edit default folders
pa_pk: مول فولڈراں نوں سودھیا نہیں جا سکدا

source: Can’t save password
pa_pk: پاس‌ورڈ سنبھالیا نہیں جا سکدا اے

source: Card number will be encrypted. Security code won’t be saved.
pa_pk: کارڈ نمبر نوں اوہلا پا لا جاۓگا۔ سرکھیا کوڈ رکھ نہیں جاۓگا۔

source: Change your password, manage data collection, or delete your account
pa_pk: آپݨا پاس‌ورڈ بدلو، ڈیٹا اکتر کرن دا انتظام کرو جاں آپݨے کھاتے نوں ہٹاؤ

source: Check out 100+ new extensions that let you make Firefox your own.
pa_pk: 100 توں ودھ پھیلاواں نوں ویکھو، جو فائرفاکس نوں تہاڈا آکھݨا بݨاوݨ لئی سہائک ہوݨ‌گیاں۔

source: Check your network connection or try reloading the page in a few moments.
pa_pk: آپݨے نیٹ‌ورک کنیکشن دی جانچ کرو جاں کجھ پلاں وچ صفحے نوں مڑ لوڈ کرن دی کوشش کرو۔

source: Choose a color
pa_pk: رنگ چݨو

source: Choose a login provider
pa_pk: لاگ ان دیݨ والا چݨو

source: Choose a wallpaper that speaks to you.
pa_pk: وال‌پیپر چُݨو، جو تہاڈے رنگ چ ڈھلے ہوݨ۔

source: Choose what to sync
pa_pk: چݨو کہ کیہہ ہم وقت کرنا اے

source: Choose which trackers and scripts to block.
pa_pk: چݨو کہ کیہڑے ٹریکراں تے سکرپٹاں تے پابندی لگاوݨی اے۔

source: City
pa_pk: شہر

source: Classic %s
pa_pk: کلاسیکی %s

source: Clear
pa_pk: صاف کرو

source: Clear permission
pa_pk: اجازت صاف کرو

source: Clear permissions
pa_pk: اجازتاں صاف کرو

source: Clear permissions on all sites
pa_pk: ساریاں سائیٹاں تے اجازتاں صاف کرو

source: Clear recent browsing history, cookies, and related data
pa_pk: حالیہ ورتوں دی تاریخ، کوکیاں تے متعلقہ ڈیٹا صاف کرو

source: Close
pa_pk: بند کرو

source: Close after one day
pa_pk: اک دن بعد بند کرو

source: Close after one month
pa_pk: اک مہینے بعد بند کرو

source: Close after one week
pa_pk: اک ہفتے بعد بند کرو

source: Close all tabs
pa_pk: ساریاں ٹیباں بند کرو

source: Close bookmarks
pa_pk: بک‌مارکاں نوں بند کرو

source: Close manually
pa_pk: خود بند کرو

source: Close private tabs
pa_pk: نجی ٹیباں نوں بند کرو

source: Close private tabs?
pa_pk: نجی ٹیباں نوں بند کرنا اے؟

source: Close reader view
pa_pk: پڑھن جھلک بند کرو

source: Close tab
pa_pk: ٹیب بند کرو

source: Close tabs
pa_pk: ٹیباں نوں بند کرو

source: Close tab %s
pa_pk: %s ٹیب بند کرو

source: Collapse saved addresses
pa_pk: سنبھالے ہوئے سرناویاں نوں سمیٹو

source: Collapse saved cards
pa_pk: سنبھالے ہاوئے کارڈاں نوں سمیٹو

source: Collapse saved passwords
pa_pk: سنبھالے ہوئے پاس‌ورڈاں نوں سموٹو

source: Collapse suggested addresses
pa_pk: تجویز دے پتے لکاؤ

source: Collapse suggested credit cards
pa_pk: تجویز دے کارڈ لکاؤ

source: Collapse suggested logins
pa_pk: تجویز لُکاؤ

source: Collection %d
pa_pk: بھنڈار %d

source: Collection deleted
pa_pk: بھنڈار ہٹیایا گیا

source: Collection menu
pa_pk: بھنڈار مینو

source: Collection name
pa_pk: بھنڈار دا ناں

source: Collection owner (User ID)
pa_pk: بھنڈار مالک (ورتونکار ID)

source: Collections
pa_pk: بھنڈار

source: Collection saved!
pa_pk: بھنڈار سنبھالیاں!

source: Collect the things that matter to you.\nGroup together similar searches, sites, and tabs for quick access later.
pa_pk: چیزاں، جو تہاڈے لئی معنی رکھدیاں ہن، نوں اکتر کرو۔ \n بعد چ فوری طور تے لبھݨ لئی اکو جیہیاں کھوجاں، سائیٹاں تے ٹیباں دا گرپ بݨاؤ۔

source: Common myths about private browsing
pa_pk: نجی ورتوں بارے عام فرضی گلاں

source: Complete action using
pa_pk: کیہنوں نال کم کرو

source: Connect another device
pa_pk: ہور ڈوائیس نال کنیکٹ کرو

source: Connect Another Device…
pa_pk: ہور ڈوائیس نال کنیکٹ کرو…

source: Content crashed
pa_pk: مواد تباہ ہو گیا

source: Content Encoding Error
pa_pk: مواد انکوڈ کرن توں غلطی

source: Continue
pa_pk: جاری رکھو

source: Continue to HTTP Site
pa_pk: غیر سرکھیت دی سائٹ نوں فیر وی جاؤ

source: Continue with extensions disabled
pa_pk: پھیلاواں نوں بند کرکے جاری رکھو

source: Control browser proxy settings
pa_pk: پراکسی سیٹنگاں نوں بدلݨا

source: Cookie Banner Blocker
pa_pk: کوکی جھنڈا روکو

source: Cookie Banner Blocker in private browsing
pa_pk: نجی براؤز کرن وچ کوکی جھنڈا روکو

source: Cookies
pa_pk: کوکیاں

source: Cookies from unvisited sites
pa_pk: نہ کھولھیاں سائیٹاں توں کوکیاں

source: Copied to clipboard
pa_pk: کلپ‌بورڈ چ کاپی کیتا

source: Copy
pa_pk: کاپی کرو

source: Copy email address
pa_pk: ای‌میل دا پتہ کاپی کرو

source: Copy image
pa_pk: تصویر کاپی کرو

source: Copy image location
pa_pk: تصویر دا پتہ کاپی کرو

source: Copy link
pa_pk: پتہ کاپی کرو

source: Copy to clipboard
pa_pk: کلپ‌بورڈ چ کاپی کرو

source: Corrupted Content Error
pa_pk: خراب ہوئی دے مواد غلطی

source: Could not open file
pa_pk: فائل کھولھ نہیں سکدی

source: Couldn’t change wallpaper
pa_pk: وال‌پیپر بدلیا نہیں جا سکیا

source: Couldn’t download wallpaper
pa_pk: وال‌پیپر ڈاؤن‌لوڈ نہیں کیتا جا سکیا

source: Country or region
pa_pk: دیش یا علاقہ

source: Crashes
pa_pk: کریش

source: Crash Reports
pa_pk: کریش رپورٹاں

source: Cross-site and social media trackers
pa_pk: انتر سائیٹ تے سماجک میڈیا ٹریکر

source: Cross-site cookies
pa_pk: انتر سائیٹ کوکیاں

source: Cross-Site Cookies
pa_pk: انتر سائیٹ کوکیاں

source: Cross-Site Tracking Cookies
pa_pk: سائیٹ بہ سائیٹ ٹوہ لیݨ دیاں کوکیاں

source: Cryptominers
pa_pk: بجلئی پیسے لاوݨ والے

source: Custom
pa_pk: چݨیا

source: Custom extension collection
pa_pk: پسندیدہ پھیلاؤ بھنڈار

source: Customize
pa_pk: چݨندا کرو

source: Customize homepage
pa_pk: مکھ صفحے دیاں ترجیحاں

source: Customize reader view
pa_pk: پڑھن جھلک دیاں ترجیحاں

source: Customize Reader View
pa_pk: پڑھن جھلک نوں پسند قاری منظر بݨاؤ

source: Custom Mozilla account server
pa_pk: پسندیدہ موزیلا کھاتا سرور

source: Custom Sync server
pa_pk: پسندیدہ سنک سرور

source: %d addresses
pa_pk: %d پتے

source: Dark
pa_pk: گوڑھا

source: Dark color scheme
pa_pk: گوڑھے رنگ دی روپ ریکھا

source: Data choices
pa_pk: ڈیٹا چوݨاں

source: Data collection
pa_pk: ڈیٹا بھنڈار

source: Dec
pa_pk: دسمبر

source: Deceptive site issue
pa_pk: فریبی سائیٹ مسئلہ

source: Default search engine
pa_pk: مول کھوج والا

source: Delete
pa_pk: مٹاؤ

source: Delete address
pa_pk: پتہ مٹاؤ

source: Delete collection
pa_pk: بھنڈار ہٹاؤ

source: Deleted %1$s
pa_pk: %1$s مٹا گیا

source: Deleted %s
pa_pk: %1$s مٹا گیا

source: Delete from history
pa_pk: تاریخ چوں ہٹاؤ

source: Delete history
pa_pk: تاریخ ہٹاؤ

source: Deleting selected folders
pa_pk: چݨو فولڈراں نوں ہٹایا جا رہا اے

source: Deny
pa_pk: اجازت نہ دیو

source: DENY
pa_pk: اجازت نہ دیو

source: Deselect all
pa_pk: سبھ نوں اݨ چݨے کرو

source: Desktop Bookmarks
pa_pk: ڈیسک‌ٹاپ بک‌مارک

source: Desktop site
pa_pk: ڈیسک‌ٹاپ سائٹ

source: Details
pa_pk: ویروے

source: Device name
pa_pk: ڈوائیس دا ناں

source: Device name cannot be empty.
pa_pk: ڈوائیس دا ناں خالی نہیں ہو سکدا۔

source: Disabled
pa_pk: بند ہو گیا اے

source: Disable private browsing
pa_pk: نجی ورتوں چالو نہ کرو

source: Disconnect
pa_pk: ڈس‌کنیکٹ کرو

source: Discover more extensions
pa_pk: ہور پھیلاؤ لبھو

source: Dismiss
pa_pk: بند کرو

source: Dismiss find in page
pa_pk: لبھݨ والے نوں بند کرو

source: Display notifications to you
pa_pk: تینوں اطلاع ویکھݨے

source: Dissatisfied
pa_pk: غیرتسلی بخش

source: Don’t allow
pa_pk: اجازت نہ دیو

source: Don’t save
pa_pk: ایہہ نہ رکھو

source: Don’t update
pa_pk: ایہنوں نہ نواں کرو

source: Download
pa_pk: آہو، ڈاؤں‌لوڈ کرو

source: Download (%1$s)
pa_pk: ڈاؤں‌لوڈ کرن (%1$s)

source: Download completed
pa_pk: ڈاؤں‌لوڈ پورا ہویا

source: Download failed
pa_pk: ڈاؤں‌لوڈ نال غلطی ہو گئی اے

source: Download files and read and modify the browser’s download history
pa_pk: فائلاں ڈاؤں‌لوڈ کرنا، تے اوہدی تاریخ نوں پڑھنا تے بدلݨا

source: Downloading and verifying add-on…
pa_pk: وادھے والا ڈاؤن‌لوڈ تے تصدیق کیتی جا رہا اے…

source: Downloading and verifying extension…
pa_pk: پھیلاؤ نوں ڈاؤن‌لوڈ تے تصدیق کیتا جا رہا اے…

source: Download link
pa_pk: ایس پتے توں ڈاؤں‌لوڈ کرو

source: Download paused
pa_pk: ڈاؤں‌لوڈ رک گیا

source: Downloads
pa_pk: ڈاؤن‌لوڈ

source: Downloads Removed
pa_pk: ڈاؤن‌لوڈ ہٹائے گئے

source: Do you want to leave this site? Data you have entered may not be saved
pa_pk: تسیں پکے او، ایس سائٹ توں چھڈݨا چاہیدے؟ کوئی کجھ پاۓ گئے ڈیٹے نہیں رکھےگا۔

source: %d page
pa_pk: %d صفحہ

source: %d pages
pa_pk: %d صفحے

source: DRM-controlled content
pa_pk: DRM کنٹرول کیتے مواد

source: %d tab
pa_pk: %d ٹیب

source: %d tabs
pa_pk: %d ٹیباں

source: %d tab selected
pa_pk: %d ٹیب چݨی

source: %d tabs selected
pa_pk: %d ٹیباں چݨیاں

source: Duplicate tab
pa_pk: ٹیب کاپی کرو

source: Edit
pa_pk: سودھو

source: EDIT
pa_pk: سودھو

source: Edit address
pa_pk: پتے نوں سودھو

source: Edit bookmark
pa_pk: بک‌مارک نوں سودھو

source: Edit engines visible in the search menu
pa_pk: کھوج مینو وچ دسݨ والے انجݨاں نوں سودھو

source: Edit folder
pa_pk: فولڈر نوں سودھو

source: Email
pa_pk: ای‌میل دا پٹہ

source: Email address copied to clipboard
pa_pk: ای‌میل دا پتہ کاپی کیتا گیا

source: Email with…
pa_pk: کیہتھوں ای‌میل بھیجو…

source: Enabled
pa_pk: چالو اے

source: Enable Gecko logs
pa_pk: گیکو لاگاں دا چالو کرو

source: Enable in all tabs
pa_pk: ساریاں ٹیباں وچ چالو کرو

source: Enable only in private tabs
pa_pk: صرف نجی ٹیباں وچ چالو کرو

source: Enable private browsing
pa_pk: نجی ورتوں چالو کرو

source: Engines visible on the search menu
pa_pk: کھوج مینو وچ دسݨ والے انجݨ

source: Enhanced Tracking Protection
pa_pk: بہتر حفاظت والا

source: Enjoy quicker navigation that’s always at your fingertips.
pa_pk: فوری نیویگیشن جو ہمیشہ تہاڈی پہنچ وچ ہندی اے دا انند ماݨو۔

source: Enter a password
pa_pk: پاس‌ورڈ پایو

source: Enter search terms
pa_pk: کھوج دی لکھت پایو

source: Erase browsing history
pa_pk: براؤز کرن دی تاریخ مٹاؤ

source: Error
pa_pk: غلطی

source: Exceptions
pa_pk: چھوٹاں

source: Exceptions let you disable tracking protection for selected sites.
pa_pk: چھوٹاں چݨیاں سائیٹاں لئی تہانوں ٹریکنگ سرکھیا نوں اسمرتھ کرن دندیاں ہن۔

source: Exchange messages with apps other than this one
pa_pk: ہورناں ایپاں نوں سنیہے بھیجݨے

source: Exit multiselect mode
pa_pk: بہو چوݨ ڈھنگ وچھوں باہر جاؤ

source: Expand saved addresses
pa_pk: سنبھالے ہوئے سرناویاں نوں پھیلاؤ

source: Expand saved cards
pa_pk: سنبھالے ہوئے کارڈاں نوں پھیلاؤ

source: Expand saved passwords
pa_pk: سنبھالے پوئے پاس‌ورڈاں نوں پھیلاؤ

source: Expand suggested addresses
pa_pk: ہور پتے ویکھو

source: Expand suggested credit cards
pa_pk: تجویز دے کارڈ ویکھو

source: Expand suggested logins
pa_pk: تجویز دے ویروے ویکھو

source: Explore extensions
pa_pk: پھیلاواں دی پڑچول کرو

source: Explore more wallpapers
pa_pk: ہور وال‌پیپر ویکھو

source: Extend developer tools to access your data in open tabs
pa_pk: کھولھویاں ٹیباں چ تہاڈے ڈیٹے پہنچݨ لئی سنداں توں ودھݨا

source: Extension collection modified. Quitting the application to apply changes…
pa_pk: پھیلاؤ بھنڈار نوں سودھیا گیا۔ تبدیلیاں لاگو کرن لئی ایپلیکیشن نوں بند کیتا جا رہا اے…

source: Extensions
pa_pk: پھیلاؤ

source: Extensions are temporarily disabled
pa_pk: پھیلاؤ عارضی طور تے غیرفعال ہن

source: Extensions level up your browsing, from changing how %s looks and performs to boosting privacy and safety.
pa_pk: پھیلاؤ تہاڈے براؤز کرن دے پدھر نوں اُچا کردیاں ہن، فیر بھاویں ایہہ %s دی وکھ تے کارگذاری نوں بدلݨا ہووے جاں پردےداری تے سرکھیا ودھاوݨا۔

source: Extensions Manager
pa_pk: پھیلاؤ مینجر

source: Extensions, navigate up
pa_pk: پھیلاواں لئی اُتے ول

source: Extension updates
pa_pk: پھیلاؤ اپڈیٹ
